Revit 2024 API
CompoundStructure.GetMaterialId Method
 Retrieves the material element id of a specified layer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ElementId GetMaterialId(
	int layerIdx
)
Visual Basic
Public Function GetMaterialId ( _
	layerIdx As Integer _
) As ElementId
Visual C++
public:
ElementId^ GetMaterialId(
	int layerIdx
)
Parameters
layerIdx
Type: System.Int32
 Index of a layer in the CompoundStructure.
Return Value
 The material element id.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The layer index is out of range.
See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace